fireFoam/testBatteryFireFOAM/wallSuppression/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 0) //0 filmWall
    (1 0 0) //1
    (1 2 0) //2
    (0 2 0) //3 filmWall
    (0 0 2) //4 filmWall
    (1 0 2) //5
    (1 2 2) //6
    (0 2 2) //7 filmWall
);

blocks          
(
    hex (0 1 2 3 4 5 6 7)   (20 10 40) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    patch side
    (
        (1 2 6 5)
    )

    //empty frontAndBack
    //cyclic sides
    patch sides
    (
        (0 1 5 4)
        (7 6 2 3)
    )

    patch outlet
    (
       (4 5 6 7)
    )

    wall ground
    (
       (0 3 2 1)
    )
    wall coupledWall 
    (
        (0 4 7 3)
    )

);

mergePatchPairs
(
);

// ************************************************************************* //
