fireFoam/testBatteryFireFOAM/wallSuppression/0/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    wall           
    {
        type            zeroGradient;
    }

    outlet          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    ground           
    {
        type            zeroGradient;
    }

    side          
    {
	type		inletOutlet;
	inletValue	$internalField;
	value		$internalField;
    }

    sides
    {
        type            cyclic;
    }

    frontAndBack    
    {
        type            cyclic;
    }
   
    burner          
    {
	    type		fixedValue;
	    value		$internalField;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
//        type            filmPyrolysisTemperatureCoupled;
//        value           uniform 300;
        //type          compressible::turbulentTemperatureCoupledBaffleMixed;
        //type          compressible::turbulentTemperatureRadiationCoupledMixed;
        //type          compressible::turbulentTemperatureRadiationQinCoupledMixed;
        type          compressible::turbulentTemperatureRadiationCoupledMixedST;
        neighbourFieldName T;
        K               none;
        neighbourFieldRadiativeName none;
        fieldRadiativeName Qin;
        value           $internalField;
    }
}


// ************************************************************************* //
