fireFoam/testBatteryFireFOAM/wallSuppression/0/filmRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/filmRegion";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform  300;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall
    {
        type            directMappedFixedInternalValue;
        average         300;
        setAverage      no;
        value           uniform 300;
    }

    side1 //bottom
    {
        type            zeroGradient;
    }

    side2
    {
        type            zeroGradient;
    }

    side3 //top
    {
        type            zeroGradient;
    }

    side4
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
