fireFoam/testBatteryFireFOAM/wallSuppression/0/filmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/filmRegion";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-0.1 0 0);

boundaryField
{
    coupledWall_top
    {
        type            slip;
    }

    coupledWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    side1 //bottom
    {
        type zeroGradient;
    }

    side2 //side
    {
            type            fixedValue;
            value           uniform (0 0 0);
    }

    side3 //top
    {
        type            filmHeightInletVelocity;               
        rho             rhof;
        value           uniform (0.0 0 0);
    }

    side4 //side
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
