fireFoam/testBatteryFireFOAM/wallSuppression/0/filmRegion/deltaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/filmRegion";
    object      deltaf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0.00;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall
    {
        type            zeroGradient;
    }

    side1 //bottom
    {
        type            zeroGradient;
    }

    side2 //side
    {
        type            zeroGradient;
    }

    side3 //top
    {
        type fixedValue;
        value uniform           0.00025;
        //value uniform           0.00035;
        //value uniform           0.00065;
        //value uniform           0.0000;
    }

    side4 //side
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
