fireFoam/testBatteryFireFOAM/wallSuppression/0/filmRegion/pSpf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/filmRegion";
    object      pSpf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0]; // Pa

internalField   uniform  0.0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall
    {
        type            directMappedFixedPushedInternalValue;
        average         0.0;
        setAverage      no;
        value           uniform 0.0;
    }

    side1 //bottom
    {
        type            zeroGradient;
    }

    side2
    {
        type            zeroGradient;
    }

    side3 //top
    {
        type            zeroGradient;
    }

    side4
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
