fireFoam/testBatteryFireFOAM/wallSuppression/0/pyrolysisRegion/filmConv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      filmConv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }
    coupledWall_side
    {
        type empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            directMappedField; // map to pyrolysis region temp field
        sampleRegion    filmRegion;
        sampleMode      nearestPatchFace;
        samplePatch     coupledWall_top;
        offset          (0 0 0);
        fieldName       qWall;
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
