fireFoam/testBatteryFireFOAM/wallSuppression/system/burner.setSet
faceSet burnerFace new boxToFace (-0.1 -2.1 -0.1)(0.201 2.51 0.01)
faceZoneSet burner new setToFaceZone burnerFace
