fireFoam/testBatteryFireFOAM/wallSuppression/system/createFilmRegionPatches.setSet
# Create face sets
#point 1 to 2
faceSet sideFaces1 new boxToFace (-1 -0.00001 -0.00001) (1  2.00001  0.00001)
#point 2 to 5
faceSet sideFaces2 new boxToFace (-1  1.99999 -0.00001) (1  2.00001  2.00001)
#point 6 to 5
faceSet sideFaces3 new boxToFace (-1 -0.00001  1.99999) (1  2.00001  2.00001) 
#point 6 to 1
faceSet sideFaces4 new boxToFace (-1  -0.00001  -0.00001) (1 0.00001  2.00001) 
